Wavetrend/RX14XX-TestApp/main.c
/**
  Generated main.c file from MPLAB Code Configurator

  @Company
    Microchip Technology Inc.

  @File Name
    main.c

  @Summary
    This is the generated main.c using PIC24 / dsPIC33 / PIC32MM MCUs.

  @Description
    This source file provides main entry point for system initialization and application code development.
    Generation Information :
        Product Revision  :  PIC24 / dsPIC33 / PIC32MM MCUs - 1.145.0
        Device            :  PIC24FJ256GB206
    The generated drivers are tested against the following:
        Compiler          :  XC16 v1.36b
        MPLAB 	          :  MPLAB X v5.25
*/

/*
    (c) 2019 Microchip Technology Inc. and its subsidiaries. You may use this
    software and any derivatives exclusively with Microchip products.

    THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
    EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED
    WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
    PARTICULAR PURPOSE, OR ITS INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION
    WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

    IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE,
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND
    WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS
    BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE
    FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN
    ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
    THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

    MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
    TERMS.
*/

/**
  Section: Included Files
*/
#include <stdio.h>
#include <stdbool.h>

#include <xc.h>
#include "mcc_generated_files/system.h"

#include "wtapi_circular_buffer.h"
#include "wt_assert.h"
#include "wt_error.h"

#include "wthal_timer_pic24.h"
#include "wthal_counter.h"
#include "wthal_observers.h"
#include "wthal_isr.h"

/*
                         Main application
 */

WTAPI_DECLARE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);
WTAPI_DEFINE_CIRCULAR_BUFFER(uint8_t, wt_rx14xx_uint8_buffer);


#define WTHAL_ISR_DECLARE(NAME) \
    typedef struct { \
        wthal_isr_t isr; \
    } NAME ## _t; \
    wthal_isr_t * const NAME ## _init(NAME ## _t * const instance, wthal_isr_priority_t const interrupt_priority, wthal_observer_t * const observers, size_t const size, wt_error_t * const error);

#define WTHAL_ISR_DEFINE(NAME, ISR, IF, IE, IP) \
    static wthal_observers_t NAME ## _active = {}; \
    static wthal_observers_t NAME ## _inactive = {}; \
    void __attribute__ (( interrupt, no_auto_psv )) ISR ( void ) { \
        wthal_observers_dispatch(&NAME ## _active); \
        IF = 0; \
    } \
    static bool NAME ## _enable_impl(void * const context, bool const enable, wt_error_t * const error) { \
        IE = enable; \
        return true; \
    } \
    static bool NAME ## _set_flag_impl(void * const context, bool const set, wt_error_t * const error) { \
        IF = set; \
        return true; \
    } \
    static bool NAME ## _get_flag_impl(void * const context, wt_error_t * const error) { \
        return IF; \
    } \
    static bool NAME ## _set_priority_impl(void * const context, uint8_t const priority, wt_error_t * const error) { \
        IP = priority; \
        return true; \
    } \
    static uint8_t NAME ## _get_priority_impl(void * const context, wt_error_t * const error) { \
        return IP; \
    } \
    static bool NAME ## _add_observer_impl(void * const context, wthal_observer_callback_t callback, void * const callback_context, wt_error_t * const error) { \
        wthal_observer_t * elem = wthal_observers_head(&NAME ## _inactive); \
        bool ok = true; \
        ok = !ok ? ok : wt_assert(elem != NULL, WT_ERROR_ENOSPC, error); \
        ok = !ok ? ok : wthal_observers_delete(&NAME ## _inactive, elem, error); \
        ok = !ok ? ok : (wthal_observer_init(elem, callback, callback_context, error) != NULL); \
        ok = !ok ? ok : wthal_observers_add(&NAME ## _active, elem, error); \
        return ok; \
    } \
    static wthal_isr_impl_t NAME ## _impl = { \
        .enable = NAME ## _enable_impl, \
        .add_observer = NAME ## _add_observer_impl, \
        .set_flag = NAME ## _set_flag_impl, \
        .get_flag = NAME ## _get_flag_impl, \
        .set_priority = NAME ## _set_priority_impl, \
        .get_priority = NAME ## _get_priority_impl, \
    }; \
    wthal_isr_t * const NAME ## _init(NAME ## _t * const instance, wthal_isr_priority_t const interrupt_priority, wthal_observer_t * const observers, size_t const size, wt_error_t * const error) { \
        IE = 0; \
        IF = 0; \
        IP = interrupt_priority; \
        wthal_observers_init(&NAME ## _active, NULL, 0, error); \
        wthal_observers_init(&NAME ## _inactive, observers, size, error); \
        return wthal_isr_init(&instance->isr, &NAME ## _impl, instance, error); \
    }

///////////////////////////////// GPIO ///////////////////////////////////////

typedef struct {

    bool (*set)(void * const, bool const high, wt_error_t * const error);
    bool (*toggle)(void * const, wt_error_t * const error);
    bool (*get)(void * const context, wt_error_t * const error);
    bool (*input)(void * const context, bool const input, wt_error_t * const error);
    bool (*analogue)(void * const context, bool const analogue, wt_error_t * const error);
    bool (*weak_pull_up)(void * const context, bool const enable, wt_error_t * const error);
    bool (*weak_pull_down)(void * const context, bool const enable, wt_error_t * const error);
    bool (*output_drain)(void * const context, bool const enable, wt_error_t * const error);
    
} wthal_gpio_impl_t;

typedef struct {
    
    wthal_gpio_impl_t * impl;
    void * context;
    
} wthal_gpio_t;

wthal_gpio_t * const wthal_gpio_init(wthal_gpio_t * const instance, wthal_gpio_impl_t * const impl, void * const context, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(instance, error);
    ok = !ok ? ok : wt_assert_ptr(impl, error);
    if (ok) {
        instance->impl = impl;
        instance->context = context;
    }
    return ok ? instance : NULL;
}

