Wavetrend/RX14XX-TestApp/main.c
bool wthal_gpio_set(wthal_gpio_t * const instance, bool const high, wt_error_t * const error) {
    return instance->impl->set(instance->context, high, error);
}

bool wthal_gpio_toggle(wthal_gpio_t * const instance, wt_error_t * const error) {
    return instance->impl->toggle(instance->context, error);
}

bool wthal_gpio_get(wthal_gpio_t * const instance, wt_error_t * const error) {
    return instance->impl->get(instance->context, error);
}

bool wthal_gpio_input(wthal_gpio_t * const instance, bool const input, wt_error_t * const error) {
    return instance->impl->input(instance->context, input, error);
}

bool wthal_gpio_analogue(wthal_gpio_t * const instance, bool const analogue, wt_error_t * const error) {
    return instance->impl->analogue(instance->context, analogue, error);
}

bool wthal_gpio_weak_pull_up(wthal_gpio_t * const instance, bool const enable, wt_error_t * const error) {
    return instance->impl->weak_pull_up(instance->context, enable, error);
}

bool wthal_gpio_weak_pull_down(wthal_gpio_t * const instance, bool const enable, wt_error_t * const error) {
    return instance->impl->weak_pull_down(instance->context, enable, error);
}

bool wthal_gpio_output_drain(wthal_gpio_t * const instance, bool const enable, wt_error_t * const error) {
    return instance->impl->output_drain(instance->context, enable, error);
}

#define WTHAL_GPIO_DECLARE(NAME) \
    typedef struct { \
        wthal_gpio_t gpio; \
    } NAME ## _t; \
    wthal_gpio_t * const NAME ## _init(NAME ## _t * const instance, wt_error_t * const error);

#define WTHAL_GPIO_DEFINE(NAME, PORT, TRIS, LAT, ANS, WPU, WPD, ODRAIN) \
    static bool NAME ## _set_impl(void * const context, bool const high, wt_error_t * const error) { \
        LAT = high; \
        return true; \
    } \
    static bool NAME ## _toggle_impl(void * const context, wt_error_t * const error) { \
        return LAT ^= 1; \
    } \
    static bool NAME ## _get_impl(void * const context, wt_error_t * const error) { \
        return PORT; \
    } \
    static bool NAME ## _input_impl(void * const context, bool const input, wt_error_t * const error) { \
        TRIS = input; \
        return true; \
    } \
    static bool NAME ## _analogue_impl(void * const context, bool const analogue, wt_error_t * const error) { \
        ANS = analogue; \
        return true; \
    } \
    static bool NAME ## _weak_pull_up_impl(void * const context, bool const enabled, wt_error_t * const error) { \
        WPU = enabled; \
        return true; \
    } \
    static bool NAME ## _weak_pull_down_impl(void * const context, bool const enabled, wt_error_t * const error) { \
        WPD = enabled; \
        return true; \
    } \
    static bool NAME ## _output_drain_impl(void * const context, bool const enabled, wt_error_t * const error) { \
        ODRAIN = enabled; \
        return true; \
    } \
    static wthal_gpio_impl_t NAME ## _impl = { \
        .set = NAME ## _set_impl, \
        .toggle = NAME ## _toggle_impl, \
        .get = NAME ## _get_impl, \
        .input = NAME ## _input_impl, \
        .analogue = NAME ## _analogue_impl, \
        .weak_pull_up = NAME ## _weak_pull_up_impl, \
        .weak_pull_down = NAME ## _weak_pull_down_impl, \
        .output_drain = NAME ## _output_drain_impl, \
    }; \
    wthal_gpio_t * const NAME ## _init(NAME ## _t * const instance, wt_error_t * const error) { \
        TRIS = 0; \
        LAT = 0; \
        ANS = 0; \
        WPU = 0; \
        WPD = 0; \
        ODRAIN = 0; \
        return wthal_gpio_init(&instance->gpio, &NAME ## _impl, instance, error); \
    }

///////////////////////////////// UART ///////////////////////////////////////

typedef struct {
    
    bool (*open)(void * const context, wt_error_t * const error);
    bool (*close)(void * const context, wt_error_t * const error);
    bool (*baudrate)(void * const context, uint32_t const baudrate, wt_error_t * const error);
    bool (*flowcontrol)(void * const context, bool const flowcontrol, wt_error_t * const error);
    size_t (*read)(void * const context, void * const data, size_t const size, wt_error_t * const error);
    size_t (*write)(void * const context, void const * const data, size_t const size, wt_error_t * const error);
    
} wthal_uart_impl_t;

typedef struct {
    
    wthal_uart_impl_t const * impl;
    void * context;
    
} wthal_uart_t;

wthal_uart_t * const wthal_uart_init(wthal_uart_t * const instance, wthal_uart_impl_t const * const impl, void * const context, wt_error_t * const error) {
    bool ok = true;
    ok = !ok ? ok : wt_assert_ptr(instance, error);
    if (ok) {
        instance->impl = impl;
        instance->context = context;
    }
    return ok ? instance : NULL;
}

bool wthal_uart_open(wthal_uart_t * const instance, wt_error_t * const error) {
    return instance->impl->open(instance->context, error);
}

bool wthal_uart_close(wthal_uart_t * const instance, wt_error_t * const error) {
    return instance->impl->close(instance->context, error);
}

bool wthal_uart_baudrate(wthal_uart_t * const instance, uint32_t const baudrate, wt_error_t * const error) {
    return instance->impl->baudrate(instance->context, baudrate, error);
}

bool wthal_uart_flowcontrol(wthal_uart_t * const instance, bool const flowcontrol, wt_error_t * const error) {
    return instance->impl->flowcontrol(instance->context, flowcontrol, error);
}

bool wthal_uart_read(wthal_uart_t * const instance, void * const data, size_t const size, wt_error_t * const error) {
    return instance->impl->read(instance->context, data, size, error);
}

bool wthal_uart_write(wthal_uart_t * const instance, void const * const data, size_t const size, wt_error_t * const error) {
    return instance->impl->write(instance->context, data, size, error);
}

#ifndef UART_TESTING
#define UART_TX_ISR(X)          (_U ## X ## TXInterrupt)
#define UART_RX_ISR(X)          (_U ## X ## RXInterrupt)
#define UART_ERR_ISR(X)         (_U ## X ## ErrInterrupt)
#define UART_TXIE(X)            (_U ## X ## TXIE)
#define UART_TXIF(X)            (_U ## X ## TXIF)
#define UART_TXIP(X)            (_U ## X ## TXIP)
#define UART_RXIE(X)            (_U ## X ## RXIE)
#define UART_RXIF(X)            (_U ## X ## RXIF)
#define UART_RXIP(X)            (_U ## X ## RXIP)
#define UART_ERIE(X)            (_U ## X ## ERIE)
#define UART_ERIF(X)            (_U ## X ## ERIF)
#define UART_ERIP(X)            (_U ## X ## ERIP)
#define UART_TXBF(X)            (U ## X ## STAbits.UTXBF)
#define UART_TXREG(X)           (U ## X ## TXREG)
#define UART_RXREG(X)           (U ## X ## RXREG)
#define UART_STA(X)             (U ## X ## STA)
#define UART_RXDA(X)            (U ## X ## STAbits.URXDA)
#define UART_OERR(X)            (U ## X ## STAbits.OERR)
#define UART_MODE(X)            (U ## X ## MODE)
#define UART_BRGH(X)            (U ## X ## MODEbits.BRGH)
#define UART_BRG(X)             (U ## X ## BRG)
#define UART_UARTEN(X)          (U ## X ## MODEbits.UARTEN)
#define UART_TXEN(X)            (U ## X ## STAbits.UTXEN)
#define UART_EN(X)              (U ## X ## MODEbits.UEN)
#endif /* UART_TESTING */

