Wavetrend/RX14XX-TestApp/main.c
}

int app_main(wthal_t * const hal, wt_error_t * const error) {

    uint32_t count = 0;
    bool ok = true;
    
    ok = !ok ? ok : wthal_counter_reset(hal->counter, error);
    ok = !ok ? ok : wthal_gpio_set(hal->startup_led, true, error);
    while (ok && wthal_counter_get(hal->counter, error) < 3000) {
        ClrWdt();
        Nop();
    }
    ok = !ok ? ok : wthal_gpio_set(hal->startup_led, false, error);
    
    while (ok)
    {
        // Add your application code
        ok = !ok ? ok : wthal_gpio_set(hal->activity_led, true, error);
        ok = !ok ? ok : wthal_counter_reset(hal->counter, error);
        while(wthal_counter_get(hal->counter, error) < 1000) {
            ClrWdt();
            Nop();
        }
        ok = !ok ? ok : wthal_gpio_set(hal->activity_led, false, error);
        ok = !ok ? ok : wthal_counter_reset(hal->counter, error);
        while(wthal_counter_get(hal->counter, error) < 1000) {
            ClrWdt();
            Nop();
        }
        for (size_t i=0 ; i < 1 ; i++) {
            printf("\nHello World %ld", (uint32_t)count++);        
        }
    }

    return 1;

}

int main(void)
{
    wt_error_t error;
    
    // initialize the device - MUST COME FIRST OR WILL OVERRIDE HAL STYLE CONFIG
    SYSTEM_Initialize();

    PPS_UNLOCK();

    // UART 1 - XBEE
    _U1RXR = 8;                 // UART1:U1RX->RP8/RB8
    _RP9R = _RPOUT_U1TX;        // RP9/RB9->UART1:U1TX
    _U1CTSR = 1;                // UART1:U1CTS->RP1/RB1
    _RP0R = _RPOUT_U1RTS;       // RP0/RB0->UART1:U1RTS

    // UART 2 - DEBUG
    _U2RXR = 23;                // UART2:U2RX->RP23/RD2
    _RP22R = _RPOUT_U2TX;       // RP22/RD3->UART2:U2TX
    
    // UART 3 - Primary Ethernet
    _U3RXR = 4;                 // UART3:U3RX->RP4/RD9
    _RP11R = _RPOUT_U3TX;       // RP11/RD0->UART3:U3TX
    _U3CTSR = 12;               // UART3:U3CTS->RP12/RD11
    _RP3R = _RPOUT_U3RTS;       // RP3/RD10->UART3:U3RTS

    // UART 4 - Secondary Ethernet
    _U4RXR = 25;                // UART4:U4RX->RP25/RD4
    _RP20R = _RPOUT_U4TX;       // RP20/RD5->UART4:U4TX
//    _U4CTSR = 12;               // UART3:U3CTS->RP12/RD11
//    _RP3R = _RPOUT_U4RTS;       // RP3/RD10->UART3:U3RTS

    PPS_LOCK();
    
    wt_rx1400_hal_t rx1400_hal;
    wthal_t * hal = wt_rx1400_hal_init(&rx1400_hal, &error);
 
    if (hal != NULL) { 
        return app_main(hal, &error);
    }
    
    return -1;

}
/**
 End of File
*/

